glcloud/keil_v5/ARM/PACK/.Web/Keil.SAML11_DFP.pdsc
          <!-- Exit Boot ROM to User Application (not possible after CMD_INIT) -->
          <sequence name="Bootrom_CMD_EXIT_ToApp">
            <block>
              __var DSU_Ctrl_Stat_Addr = 0x41002100;    // Access DSU External Address Range (for all DALs)
              __var DSU_BCC0_Addr      = 0x41002120;    // Access DSU External Address Range (for all DALs)
              
              Write32(DSU_Ctrl_Stat_Addr, 0x00002000);  // Boot Rom Phase Extension in DSU.STATA to return to app after CMD_EXIT
              Write32(DSU_BCC0_Addr, 0x444247AA);       // Write CMD_EXIT
              Sequence("Bootrom_CheckError");
            </block>
          </sequence>
          
          <!-- Exit Boot ROM to CPU Park Mode (allows access to NVMCTRL while CPU still halted, not possible after CMD_INIT) -->
          <sequence name="Bootrom_CMD_EXIT_ToPark">
            <block>
              __var DSU_Ctrl_Stat_Addr = 0x41002100;    // Access DSU External Address Range (for all DALs)
              __var DSU_BCC0_Addr      = 0x41002120;    // Access DSU External Address Range (for all DALs)
              __var DSU_BCC1_Addr      = 0x41002124;    // Access DSU External Address Range (for all DALs)
              __var DSU_BCC1_Val       = 0;
              
              Write32(DSU_BCC0_Addr, 0x444247AA);       // Write CMD_EXIT
              Sequence("Bootrom_CheckError");
            </block>
          </sequence>

          <!-- Execute System Reset via Boot ROM -->
          <sequence name="Bootrom_CMD_RESET" info="System Reset">
            <block>
              __var DSU_Ctrl_Stat_Addr = 0x41002100;    // Access DSU External Address Range (for all DALs)
              __var DSU_BCC0_Addr      = 0x41002120;    // Access DSU External Address Range (for all DALs)
              
              Message(0, "Execute Bootrom Reset...");
              
              __errorcontrol = 1;                       // Ignore errors
              Write32(DSU_BCC0_Addr, 0x44424752);       // Write CMD_RESET
              __errorcontrol = 0;                       // Check errors
              
              Sequence("DebugPortSetup");
              Sequence("DebugPortStart");
            </block>
          </sequence>
          
          <!-- Program Debug Access Level 1 -->
          <sequence name="NVMCTRL_SetDAL1">
            <block>
              __var DSU_Ctrl_Stat_Addr   = 0x41002100;  // Access DSU External Address Range (for all DALs)
              __var PAC_WRCTRL_Addr      = 0x40000000;
              __var NVMCTRL_CTRLA_Addr   = 0x41004000;
              __var DebugAccessLevel     = 0;
              
              Message(0, "Set Debug Access Level 1...");
              
              DebugAccessLevel = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;  // Read Debug Access Level
            </block>
            <control if="DebugAccessLevel == 2" info="Secure Debug Access?">
              <block>
                PAC_WRCTRL_Addr    += 0x0200;           // Use secure alias
                NVMCTRL_CTRLA_Addr += 0x1000;           // Use secure alias
              </block>
            </control>
            <block>
              Write32(PAC_WRCTRL_Addr, (( 1 &lt;&lt; 16) | (34 &lt;&lt;  0)));  // Disable NVMCTRL Write Protection
              Write32(NVMCTRL_CTRLA_Addr, 0xA54C);                              // Set Debug Access Level 1 (Non-Volatile until next Chip Erase or Set DAL 0)
            </block>
          </sequence>
          
          <!-- Program Debug Access Level 0 -->
          <sequence name="NVMCTRL_SetDAL0">
            <block>
              __var DSU_Ctrl_Stat_Addr   = 0x41002100;  // Access DSU External Address Range (for all DALs)
              __var PAC_WRCTRL_Addr      = 0x40000000;
              __var NVMCTRL_CTRLA_Addr   = 0x41004000;
              __var DebugAccessLevel     = 0;
              
              Message(0, "Set Debug Access Level 0...");
              
              DebugAccessLevel = (Read32(DSU_Ctrl_Stat_Addr) &amp; 0x00030000) &gt;&gt; 16;  // Read Debug Access Level
            </block>
            <control if="DebugAccessLevel == 2" info="Secure Debug Access?">
              <block>
                PAC_WRCTRL_Addr    += 0x0200;           // Use secure alias
                NVMCTRL_CTRLA_Addr += 0x1000;           // Use secure alias
              </block>
            </control>
            <block>
              Write32(PAC_WRCTRL_Addr, (( 1 &lt;&lt; 16) | (34 &lt;&lt;  0)));  // Disable NVMCTRL Write Protection
              Write32(NVMCTRL_CTRLA_Addr, 0xA54B);                              // Set Debug Access Level 0 (Non-Volatile until next Chip Erase)
            </block>
          </sequence>
          
          <!-- Force CPU into Debug Halt - To be reviewed -->
          <sequence name="ForceCoreHalt">
            <block>
              __var DSU_Ctrl_Stat_Addr = 0x41002100;    // Access DSU External Address Range (for all DALs)
              __var DHCSR_Addr         = 0xE000EDF0;
              __var DCRSR_Addr         = 0xE000EDF4;
              __var DCRDR_Addr         = 0xE000EDF8;
              __var DebugAccessLevel   = 0;
              
              DAP_Delay(5000);                          // Workaround for MDK issue to be fixed
            </block>

            <!-- wait until core has stopped -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0" timeout="100000"/>

            <block info="Halt core">
              Write32(DHCSR_Addr,0xA05F0003);                                  // halt core in any case
            </block>

            <block info="Update xPSR register">
              Write32(DCRDR_Addr, 0x01000000);
              Write32(DCRSR_Addr, 0x00010010);                                 // update xPSR register (TODO: why?)
            </block>
            <control while="(Read32(DHCSR_Addr) &amp; 0x00010000) == 0" timeout="100000"/>
          </sequence>

          <!-- Unlock Device -->
          <sequence name="DebugDeviceUnlock">
            <block>
              __var DSU_Ctrl_Stat_Addr = 0x41002100;    // Access DSU External Address Range (for all DALs)
              __var DSU_Ctrl_Stat_Val  = 0;
              __var DebugAccessLevel   = 0;
              __var QueryResult        = 0;

              DSU_Ctrl_Stat_Val = Read32(DSU_Ctrl_Stat_Addr);
            </block>
            
            <!-- "under reset" bit not in current uVision build -->
            <control if="DSU_Ctrl_Stat_Val &amp; 0x00000200" info="STATUSB.CRSTEXT active - Cold Plugin">
              <control if="(__connection &amp; 0xFF) != 2">
                <!-- Release to App for normal debug connection -->
                <block>
                  Sequence("CheckForChecksumError");
                  Sequence("Bootrom_Connect");
                  Sequence("Bootrom_CMD_EXIT_ToApp");
                  Sequence("BootDelay");
                  Sequence("ForceCoreHalt");
                </block>
              </control>
              <control if="(__connection &amp; 0xFF) == 2">
                <!-- Selected Chip Erase for Flash Download connection under reset -->
                <block>
                  Sequence("Bootrom_Connect");
                  Sequence("Bootrom_CMD_INIT");
                  Sequence("Bootrom_CMD_CEx");
                  Sequence("ResetHardware");
                  Sequence("ForceCoreHalt");
                </block>
              </control>
            </control>
            
          </sequence>
          
          <!-- SYSRESETREQ -->
          <sequence name="ResetSystem" info="SYSRESETREQ">
            <block>
              __var AIRCR_Addr = 0xE000ED0C;
              __var DHCSR_Addr = 0xE000EDF0;

