glcloud/keil_v5/ARM/PACK/.Web/Keil.SAML11_DFP.pdsc
      <condition id="ATSAML11E15A">
         <require Dvendor="Atmel:3" Dname="ATSAML11E15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML11D15A">
         <require Dvendor="Atmel:3" Dname="ATSAML11D15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML11D14A">
         <require Dvendor="Atmel:3" Dname="ATSAML11D14A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAML11D16A">
         <description>Headers and startup code for Atmel ATSAML11D16A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_saml11d16a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_saml11d16a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/saml11d16a_flash.ld"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/saml11d16a_sram.ld"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_saml11d16a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_saml11d16a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/config/linker/Microchip/atsaml11d16a/sram.icf"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/config/linker/Microchip/atsaml11d16a/flash.icf"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/startup_saml11.s"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/system_saml11d16a.c"
                  attr="config" version="1.0.0"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAML11E16A">
         <description>Headers and startup code for Atmel ATSAML11E16A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_saml11e16a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_saml11e16a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/saml11e16a_flash.ld"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/saml11e16a_sram.ld"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_saml11e16a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_saml11e16a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/config/linker/Microchip/atsaml11e16a/sram.icf"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/config/linker/Microchip/atsaml11e16a/flash.icf"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/startup_saml11.s"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/system_saml11e16a.c"
                  attr="config" version="1.0.0"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAML11E14A">
         <description>Headers and startup code for Atmel ATSAML11E14A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_saml11e14a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_saml11e14a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/saml11e14a_flash.ld"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/saml11e14a_sram.ld"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_saml11e14a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_saml11e14a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/config/linker/Microchip/atsaml11e14a/sram.icf"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/config/linker/Microchip/atsaml11e14a/flash.icf"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/startup_saml11.s"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/system_saml11e14a.c"
                  attr="config" version="1.0.0"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAML11E15A">
         <description>Headers and startup code for Atmel ATSAML11E15A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_saml11e15a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_saml11e15a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/saml11e15a_flash.ld"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/saml11e15a_sram.ld"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_saml11e15a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_saml11e15a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/config/linker/Microchip/atsaml11e15a/sram.icf"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/config/linker/Microchip/atsaml11e15a/flash.icf"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/startup_saml11.s"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/system_saml11e15a.c"
                  attr="config" version="1.0.0"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAML11D15A">
         <description>Headers and startup code for Atmel ATSAML11D15A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_saml11d15a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_saml11d15a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/saml11d15a_flash.ld"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/saml11d15a_sram.ld"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_saml11d15a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_saml11d15a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/config/linker/Microchip/atsaml11d15a/sram.icf"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/config/linker/Microchip/atsaml11d15a/flash.icf"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/startup_saml11.s"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/system_saml11d15a.c"
                  attr="config" version="1.0.0"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAML11D14A">
         <description>Headers and startup code for Atmel ATSAML11D14A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/gcc/startup_saml11d14a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="source"
                  name="gcc/system_saml11d14a.c"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="gcc/gcc/saml11d14a_flash.ld"
                  attr="config" version="1.0.0"/>
            <file condition="GCC Exe"
                  category="other"
                  name="gcc/gcc/saml11d14a_sram.ld"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/iar/startup_saml11d14a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="source"
                  name="iar/system_saml11d14a.c"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="iar/config/linker/Microchip/atsaml11d14a/sram.icf"
                  attr="config" version="1.0.0"/>
            <file condition="IAR Exe"
                  category="other"
                  name="iar/config/linker/Microchip/atsaml11d14a/flash.icf"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/startup_saml11.s"
                  attr="config" version="1.0.0"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="armcc/SAML11/system_saml11d14a.c"
                  attr="config" version="1.0.0"/>
         </files>
      </component>
   </components>
   
